const mapper = [
  ['ハーレム', '后宫'],
  ['シリアス', '严肃'],
  ['ほのぼの', '温暖'],
  ['バトル', '战斗'],
  ['ラブコメ', '爱情喜剧'],
  ['ハッピーエンド', 'HappyEnd'],
  ['バッドエンド', 'BadEnd'],
  ['嘘コク', '假告白'],
  ['ギャグ', '搞笑'],
  ['チート', '作弊'],
  ['ファンタジー', '奇幻'],
  ['スクールラブ', '校园爱情'],
  ['ダーク', '黑暗'],
  ['ミステリー', '推理'],
  ['ヒーロー', '英雄'],
  ['ヒロイン', '女英雄'],
  ['ダンジョン', '迷宫'],
  ['ざまぁ', '活该'],
  ['ざまあ', '活该'],
  ['ディストピア', '反乌托邦'],
  ['アイドル', '偶像'],
  ['シスター', '修女'],
  ['成り上がり', '暴发户'],
  ['ライトノベル', '轻小说'],
  ['セフレ', '性伙伴'],
  ['ホームドラマ', '家庭剧'],
  ['パラレルワールド', '平行世界'],
  ['ヤンデレ', '病娇'],
  ['ツンデレ', '傲娇'],
  ['ゲーム', '游戏'],
  ['コミカライズ', '漫画化'],
  ['アニメ化', '动画化'],
  ['スキル', '技能'],
  ['ボーイズラブ', '耽美'],
  ['ガールズラブ', '百合'],
  ['ドラゴン', '龙'],
  ['いじめ', '欺凌'],
  ['レイプ', '强奸'],
  ['ロリ', '萝莉'],
  ['コメディ', '喜剧'],
  ['カクヨムオンリー', 'Kakuyomu原创'],
];

export function tryTranslateKeywords(keywords: string[]) {
  return keywords.map((keyword) => {
    mapper.forEach(([jp, zh]) => {
      keyword = keyword.replace(jp, zh);
    });
    return keyword;
  });
}
